app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "assignments"