app/controllers/defects_controller.rb

  def index
    @defects = Defect.all.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "defects" WHERE (created_at > '2010-02-27 09:27:00') ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "defects" WHERE (created_at > '2010-02-27 07:19:15')

  def show
    @defect = Defect.find(params[:id])
---
SELECT * FROM "defects" WHERE ("defects"."id" = 1)

  def edit
    @defect = Defect.find(params[:id])
---
SELECT * FROM "defects" WHERE ("defects"."id" = 8)