app/controllers/projects_controller.rb

  def index
    @projects = Project.all.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "projects"