app/controllers/sources_controller.rb

  def index
    @sources = Source.all.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "sources"

  def show
    @source = Source.find(params[:id])
---
SELECT * FROM "sources" WHERE ("sources"."id" = 5)

  def edit
    @source = Source.find(params[:id])
---
SELECT * FROM "sources" WHERE ("sources"."id" = 2)

  def create
    @source = Source.new(params[:source])

    respond_to do |format|
      if @source.save
---
INSERT INTO "sources" ("name", "updated_at", "created_at") VALUES('Server', '2010-03-04 07:58:30', '2010-03-04 07:58:30')