app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    params[:user][:login] = params[:user][:username]
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "username", "remember_token", "first_name", "is_faculty", "login", "last_name", "email", "created_at", "active") VALUES('', '8a4f9b2f7354052e7e56cc08be54ff4e3e3f98cb', '2010-03-04 06:55:16', '8b3e5534edb023e0bd3615014081e20c60712c80', NULL, 'teenslayer', NULL, 'Ashley', NULL, NULL, 'Jiang', 'teenslayer@gmail.com', '2010-03-04 06:55:16', NULL)